<a href="https://colab.research.google.com/github/satishgunjal/Machine-Learning-Using-Python/blob/master/09_Decision_Tree/Exercise_Decision_Tree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exercise: 

*   Build decision tree model to predict survival based on certain parameters
*   csv file : 09_Decision_Tree/exercise_titanic.csv
*   In this file using following columns build a model to predict if person would survive or not,

      Pclass

      Sex

      Age

      Fare
*   Calculate score of your model

[Kaggle Ref](https://www.kaggle.com/c/titanic/overview)

Let load the data

In [0]:
import pandas as pd

In [0]:
#For local notebook
#df = pd.read_csv('exercise_titanic.csv')
#df

In [2]:
from google.colab import files

uploaded = files.upload()

Saving exercise_titanic.csv to exercise_titanic.csv

In [19]:
import io

df = pd.read_csv(io.StringIO(uploaded['exercise_titanic.csv'].decode('utf-8')))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Since our prediction is based on only (Pclass, Sex, Age, Fare) and 'Survived' os our target variable lets drop the other columns

In [20]:
df_final = df.drop(['PassengerId', 'Name', 'SibSp','Parch', 'Ticket', 'Cabin' ,'Embarked'],axis= 'columns')
df_final.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

Cross check for every input column there shouldnt be a null value

In [22]:
df_final.Age[:10] #get first 10 values

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

Since Age column has null values, lets replace them with 'mean' valuesm

In [23]:
df_final.Age = df_final.Age.fillna(df_final.Age.mean())
df_final.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

Now lets use OneHotEncoding for 'Sex' column

In [24]:
from sklearn.preprocessing import LabelEncoder # importing LabelEncoder class

le_Sex = LabelEncoder() # classifier of class LabelEncoder
df_final['Sex_n'] = le_Sex.fit_transform(df_final['Sex'])
df_final.head()

   Survived  Pclass     Sex   Age     Fare  Sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

Now lets drop the 'Sex' column

In [25]:
df_final = df_final.drop(['Sex'],axis='columns')
df_final.head()

   Survived  Pclass   Age     Fare  Sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

Now lets create inputs variable

In [26]:
inputs = df_final.drop(['Survived'],axis='columns')
inputs.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

Now leats create target variable

In [27]:
target = df_final['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

Now lets split the dataset into training and test

In [30]:
from sklearn.model_selection import train_test_split # importing a class
X_train ,X_test, y_train,y_test = train_test_split(inputs,target,test_size=0.2)

print("len of X_train is %s" % (len(X_train)))
print("len of X_test is %s" % (len(X_test)))
print("len of y_train is %s" % (len(y_train)))
print("len of y_test is %s" % (len(y_test)))

len of X_train is 712
len of X_test is 179
len of y_train is 712
len of y_test is 179

Now lets train the model

In [31]:
from sklearn import tree # importing tree class

model = tree.DecisionTreeClassifier()
model.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [32]:
model.score(X_test,y_test)

0.8491620111731844